In [1]:
import pandas as pd
from datetime import datetime

## Read in and clean the unemployment data

In [2]:
file= "Resources/monthly_unemployment.csv"
unemployment_df= pd.read_csv(file)
unemployment_df.dtypes

Unnamed: 0      int64
date           object
value         float64
dtype: object

In [3]:
# convert to datetime
unemployment_df['date'] = pd.to_datetime(unemployment_df['date'], errors='coerce')
# show the types
unemployment_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 890 entries, 0 to 889
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  890 non-null    int64
 1   date        890 non-null    datetime64[ns]
 2   value       890 non-null    float64
dtypes: datetime64[ns](1), float64(1), int64(1)
memory usage: 21.0 KB

In [4]:
unemployment_df['Month'] = unemployment_df['date'].dt.month
unemployment_df['Year'] = unemployment_df['date'].dt.year
unemployment_df.head()

   Unnamed: 0       date  value  Month  Year
0           0 2022-02-01    3.8      2  2022
1           1 2022-01-01    4.0      1  2022
2           2 2021-12-01    3.9     12  2021
3           3 2021-11-01    4.2     11  2021
4           4 2021-10-01    4.6     10  2021

In [5]:
cols=["Month","Year"]
unemployment_df['Date'] = unemployment_df[cols].apply(lambda x: '-'.join(x.values.astype(str)), axis="columns")
unemployment_df.head()

   Unnamed: 0       date  value  Month  Year     Date
0           0 2022-02-01    3.8      2  2022   2-2022
1           1 2022-01-01    4.0      1  2022   1-2022
2           2 2021-12-01    3.9     12  2021  12-2021
3           3 2021-11-01    4.2     11  2021  11-2021
4           4 2021-10-01    4.6     10  2021  10-2021

In [6]:
unemployment_df = unemployment_df.drop(['Unnamed: 0','date','Month','Year'], axis=1)
unemployment_df.rename(columns={'value': 'Unemployment Rate'}, inplace=True)
unemployment_df.head()

   Unemployment Rate     Date
0                3.8   2-2022
1                4.0   1-2022
2                3.9  12-2021
3                4.2  11-2021
4                4.6  10-2021

In [7]:
# Save the cleaned data to a CSV file
unemployment_df.to_csv('Resources/unemployment_cleaned.csv')

## read in and clean the inflation data

In [8]:
file= "Resources/monthly_inflation.csv"
inflation_df= pd.read_csv(file)
inflation_df.dtypes

Unnamed: 0      int64
date           object
value         float64
dtype: object

In [9]:
# convert to datetime
inflation_df['date'] = pd.to_datetime(inflation_df['date'], errors='coerce')
# show the types
inflation_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 530 entries, 0 to 529
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  530 non-null    int64
 1   date        530 non-null    datetime64[ns]
 2   value       530 non-null    float64
dtypes: datetime64[ns](1), float64(1), int64(1)
memory usage: 12.5 KB

In [10]:
inflation_df['Month'] = inflation_df['date'].dt.month
inflation_df['Year'] = inflation_df['date'].dt.year
inflation_df.head()

   Unnamed: 0       date  value  Month  Year
0           0 2022-02-01    4.9      2  2022
1           1 2022-01-01    4.9      1  2022
2           2 2021-12-01    4.8     12  2021
3           3 2021-11-01    4.9     11  2021
4           4 2021-10-01    4.8     10  2021

In [11]:
cols=["Month","Year"]
inflation_df['Date'] = inflation_df[cols].apply(lambda x: '-'.join(x.values.astype(str)), axis="columns")
inflation_df.head()

   Unnamed: 0       date  value  Month  Year     Date
0           0 2022-02-01    4.9      2  2022   2-2022
1           1 2022-01-01    4.9      1  2022   1-2022
2           2 2021-12-01    4.8     12  2021  12-2021
3           3 2021-11-01    4.9     11  2021  11-2021
4           4 2021-10-01    4.8     10  2021  10-2021

In [12]:
inflation_df = inflation_df.drop(['Unnamed: 0','date','Month','Year'], axis=1)
inflation_df.rename(columns={'value': 'Inflation Expectation'}, inplace=True)
inflation_df.head()

   Inflation Expectation     Date
0                    4.9   2-2022
1                    4.9   1-2022
2                    4.8  12-2021
3                    4.9  11-2021
4                    4.8  10-2021

In [13]:
# Save the cleaned data to a CSV file
inflation_df.to_csv('Resources/inflation_cleaned.csv')

## read in and clean the retail sales data

In [14]:
file= "Resources/monthly_retail_sales.csv"
retail_sales_df= pd.read_csv(file)
retail_sales_df.dtypes

Unnamed: 0     int64
date          object
value          int64
dtype: object

In [15]:
# convert to datetime
retail_sales_df['date'] = pd.to_datetime(retail_sales_df['date'], errors='coerce')
# show the types
retail_sales_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 362 entries, 0 to 361
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  362 non-null    int64
 1   date        362 non-null    datetime64[ns]
 2   value       362 non-null    int64
dtypes: datetime64[ns](1), int64(2)
memory usage: 8.6 KB

In [16]:
retail_sales_df['Month'] = retail_sales_df['date'].dt.month
retail_sales_df['Year'] = retail_sales_df['date'].dt.year
retail_sales_df.head()

   Unnamed: 0       date   value  Month  Year
0           0 2022-02-01  509967      2  2022
1           1 2022-01-01  520757      1  2022
2           2 2021-12-01  636842     12  2021
3           3 2021-11-01  583223     11  2021
4           4 2021-10-01  559399     10  2021

In [17]:
cols=["Month","Year"]
retail_sales_df['Date'] = retail_sales_df[cols].apply(lambda x: '-'.join(x.values.astype(str)), axis="columns")
retail_sales_df.head()

   Unnamed: 0       date   value  Month  Year     Date
0           0 2022-02-01  509967      2  2022   2-2022
1           1 2022-01-01  520757      1  2022   1-2022
2           2 2021-12-01  636842     12  2021  12-2021
3           3 2021-11-01  583223     11  2021  11-2021
4           4 2021-10-01  559399     10  2021  10-2021

In [18]:
retail_sales_df = retail_sales_df.drop(['Unnamed: 0','date','Month','Year'], axis=1)
retail_sales_df.rename(columns={'value': 'Retail Sales'}, inplace=True)
retail_sales_df.head()

   Retail Sales     Date
0        509967   2-2022
1        520757   1-2022
2        636842  12-2021
3        583223  11-2021
4        559399  10-2021

In [19]:
# Save the cleaned data to a CSV file
retail_sales_df.to_csv('Resources/retail_sales_cleaned.csv')